<script>
    export let close;
</script>
<main>
    <button on:click={close}>닫기</button>
    [web-collector] 개인정보 이용 동의서

    안녕하세요. [web-collector]를 이용해주셔서 감사합니다.

    저희 [web-collector]는 아이디, 비밀번호, 닉네임 등의 개인정보를 수집하여 로그인 세션을 관리하고 서비스를 제공합니다. 이에 따라 아래와 같은 개인정보 이용 동의서를 작성하였습니다. 사용자의 개인정보를 보호하기 위해 동의서를 꼭 읽어주시고, 동의하신다면 아래의 [동의] 버튼을 클릭해주세요.

    1. 수집하는 개인정보 항목:
    - 아이디: 로그인에 사용되는 정보
    - 비밀번호: 계정 보안을 위해 사용되는 정보
    - 닉네임: 서비스 내에서 사용되는 사용자 이름

    2. 개인정보의 수집 및 이용 목적:
    - 로그인 세션 관리: 아이디와 비밀번호를 사용하여 로그인 상태를 유지하고 서비스를 이용할 수 있도록 합니다.
    - 서비스 제공: 닉네임은 서비스 내에서 사용자를 구분하는 데 사용됩니다.

    3. 개인정보의 보유 및 이용 기간:
    - [web-collector]에서 제공하는 서비스를 이용하는 동안에는 개인정보를 보유하며, 서비스 이용 종료 후에는 즉시 파기됩니다.

    4. 동의를 거부할 권리:
    - 위 개인정보 수집 및 이용에 대한 동의는 선택적이며, 동의하지 않을 권리가 있습니다. 그러나 동의를 거부할 경우 서비스 이용이 제한될 수 있습니다.

    5. 개인정보의 제3자 제공:
    - 저희 [web-collector]는 사용자의 개인정보를 제3자와 공유하거나 제공하지 않습니다. 단, 관련 법규에 따라 요구된 경우 또는 사용자의 동의가 있을 경우에는 예외적으로 제공될 수 있습니다.

    6. 기타 사항:
    - 본 동의서에 명시되지 않은 사항은 [web-collector]의 개인정보 처리 방침에 따릅니다.

    위의 내용을 숙지하시고, [web-collector]의 개인정보 이용에 동의하시면 아래의 [동의] 버튼을 클릭하여 동의해주시기 바랍니다. 동의하지 않을 경우 로그인이 제한될 수 있습니다.

    동의합니다. [동의] / 동의하지 않습니다.
</main>